# 2nd part: Querying

Read from the SQLite file and start querying

database: dbase

tables: question, respondent, response

respondent columns: 'respondent_id','study_id','sex','date','n_children'

response columns: 'id','study_id','respondent_id','question_id','response'

In [24]:
import sqlite3
import pandas as pd
import numpy as np
from pandas.io import sql
import matplotlib.pyplot as plt

%matplotlib inline
conn = sqlite3.connect('./dbase.sqlite')

In [17]:
query="""
SELECT sum(question_id='Q1' and response < 3) AS "'Strongly disagree' or 'disagree' for Q1"
FROM response
"""

sql.read_sql(query, con=conn)

   'Strongly disagree' or 'disagree' for Q1
0                                         6

In [18]:
query="""
SELECT 
CASE WHEN rest.sex = 1 THEN 'Male'
     WHEN rest.sex = 2 THEN 'Female'
     END AS Gender,
SUM(question_id='Q1' and response < 3) AS "'Strongly disagree' or 'disagree' for Q1"
FROM response resp
LEFT JOIN respondent rest
on (resp.respondent_id = rest.id and resp.study_id=rest.study_id)
GROUP BY Gender
"""

sql.read_sql(query, con=conn)

   Gender  'Strongly disagree' or 'disagree' for Q1
0  Female                                         4
1    Male                                         2

In [19]:
query="""
SELECT 
CASE WHEN rest.sex = 1 THEN 'Male'
     WHEN rest.sex = 2 THEN 'Female'
     END AS Gender,
SUM(question_id='Q1' and response < 3) AS "'Strongly Disagree' or 'Disagree' for Q1",
SUM(question_id='Q1' and response = 3) AS "'Neutral' for Q1",
SUM(question_id='Q1' and (response = 4 or response = 5)) AS "'Agree' or 'Strongly Agree' for Q1"
FROM response resp
LEFT JOIN respondent rest
on (resp.respondent_id = rest.id and resp.study_id=rest.study_id)
GROUP BY Gender
"""

sql.read_sql(query, con=conn)

,Gender,'Strongly Disagree' or 'Disagree' for Q1,'Neutral' for Q1,'Agree' or 'Strongly Agree' for Q1
0,Female,4,1,4
1,Male,2,3,5

In [31]:
query="""
SELECT
SUM(question_id='Q3_1' and response = 1) AS "Orange",
SUM(question_id='Q3_2' and response = 1) AS "Blue",
SUM(question_id='Q3_3' and response = 1) AS "Red",
SUM(question_id='Q3_4' and response = 1) AS "Purple",
SUM(question_id='Q3_5' and response = 1) AS "Pink",
SUM(question_id='Q3_6' and response = 1) AS "Don't know"
FROM response
"""

sql.read_sql(query, con=conn)

   Orange  Blue  Red  Purple  Pink  Don't know
0      11    13    7       8    11           2

In [33]:
query="""
SELECT 
CASE WHEN rest.sex = 1 THEN 'Male'
     WHEN rest.sex = 2 THEN 'Female'
     END AS Gender,
SUM(question_id='Q3_1' and response = 1) AS "Orange",
SUM(question_id='Q3_2' and response = 1) AS "Blue",
SUM(question_id='Q3_3' and response = 1) AS "Red",
SUM(question_id='Q3_4' and response = 1) AS "Purple",
SUM(question_id='Q3_5' and response = 1) AS "Pink",
SUM(question_id='Q3_6' and response = 1) AS "Don't know"
FROM response resp
LEFT JOIN respondent rest
on (resp.respondent_id = rest.id and resp.study_id=rest.study_id)
GROUP BY Gender
"""

sql.read_sql(query, con=conn)

   Gender  Orange  Blue  Red  Purple  Pink  Don't know
0  Female       6     7    4       4     5           1
1    Male       5     6    3       4     6           1

In [35]:
query="""
SELECT 
SUM(n_children = 0) AS "No children",
SUM(n_children between 1 and 2) AS "1-2 children",
SUM(n_children > 2) AS "3 or more children"
FROM respondent
WHERE study_id = 102
"""

sql.read_sql(query, con=conn)

   No children  1-2 children  3 or more children
0            3             4                   3

Done